app/controllers/gifts_controller.rb

	def index
		@gifts = Gift.all
---
SELECT "gifts".* FROM "gifts"

  def create
    Gift.create( name:    params[:name],
    						 price:   params[:price],
    						 website: params[:website],
    						 taken:   params[:taken]
    					 )
---
INSERT INTO "gifts" ("created_at", "name", "price", "taken", "updated_at", "website") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Mon, 02 Jun 2014 04:01:10 UTC +00:00], ["name", "book"], ["price", 10.0], ["taken", nil], ["updated_at", Mon, 02 Jun 2014 04:01:10 UTC +00:00], ["website", "http://"]]

	def edit
		@gift = Gift.find(params[:id])
---
SELECT "gifts".* FROM "gifts" WHERE "gifts"."id" = $1 LIMIT 1  [["id", "1"]]

	def show
		@gift = Gift.find(params[:id])
---
SELECT "gifts".* FROM "gifts" WHERE "gifts"."id" = $1 LIMIT 1  [["id", "index"]]

	def update
		@gift         = Gift.find(params[:id])
		@gift.name    = params[:name]
		@gift.price   = params[:price]
		@gift.website = params[:website]
		@gift.taken   = params[:taken]
		@gift.save
---
SELECT "gifts".* FROM "gifts" WHERE "gifts"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "gifts" SET "website" = 'http://a', "updated_at" = '2014-06-02 04:46:30.418212' WHERE "gifts"."id" = 1